AccumulationRegisters/РегистрПредметов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<Name>РегистрПредметов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Игрок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Игроки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предметы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

CommonForms/Инвентарь/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Отбор") и Параметры.Отбор.Свойство("Игрок") тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
			|	РегистрПредметовОстатки.Предмет КАК Предмет,
			|	РегистрПредметовОстатки.КоличествоОстаток КАК Количество
			|ИЗ
			|	РегистрНакопления.РегистрПредметов.Остатки(, Игрок = &Игрок) КАК РегистрПредметовОстатки";
		Запрос.Параметры.Вставить("Игрок",Параметры.Отбор.Игрок);
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		РеквезитИнвентарь.Загрузить(РезультатЗапроса);                
	КонецЕсли;
КонецПроцедуры
